#include<stdio.h>
#include<stdlib.h>
#include<locale.h>

void main()
{
	setlocale(LC_ALL, "Rus");

	//// 1.	1.	Найти значение функции y = 3x6 −6x2 −7 при данном значении x.



	//int x = 0, y = 0;

	//printf("Введите значение x: ");
	//scanf("%d", &x);

	//y = (3 * (x*x*x*x*x*x)) - (6 * (x*x)) - 7;

	//printf("y=%d\n", y);


	////2.	Найти значение функции y = 4(x−3)6 − 7(x−3)3 + 2 при данном значении x.


	//int x = 0, y = 0;

	//printf("Введите значение x: ");
	//scanf("%d", &x);

	//y = (4 * (x - 3)*(x - 3)*(x - 3)*(x - 3)*(x - 3)*(x - 3)) - (7 * (x - 3)*(x - 3)*(x - 3)) + 2;

	//printf("y=%d\n", y);



	////3.	Дано число A.Вычислить A8, используя вспомогательную переменную и три операции умножения.
	////Для этого последовательно находить A2, A4, A8.Вывести все найденные степени числа A.


	//int a = 0, b = 0;

	//printf("Введите значение a: ");
	//scanf("%d", &a);

	//b = a*a;
	//printf("A^2=%d\n", b);

	//b = b*b;
	//printf("A^4=%d\n", b);

	//b = b*b;
	//printf("A^8=%d\n", b);



	////4.	Дано число A. Вычислить A15, используя две вспомогательные переменные и пять операций умножения. 
	////Для этого последовательно находить A2, A3, A5, A10, A15. Вывести все найденные степени числа A.


	//int a = 0, b = 0, c = 0;

	//printf("Введите значение A:");
	//scanf("%d", &a);

	//b = a*a;
	//printf("A^2=%d\n", b);

	//c = b*a;
	//printf("A^3=%d\n", c);

	//c = b*c;
	//printf("A^5=%d\n", c);

	//b = c*c;
	//printf("A^10=%d\n", b);

	//c = b*c;
	//printf("A^15=%d\n", c);


	////5.	Дано значение температуры T в градусах Фаренгейта. Определить значение этой же температуры в градусах Цельсия.
	////Температура по Цельсию TC и температура по Фаренгейту TF связаны следующим соотношением: TC = (TF − 32)·5/9.


	//float tf = 0, tc = 0;

	//printf("Введите значение температуры: ");
	//scanf("%f", &tf);

	//tc = (tf - 32) * 5 / 9;
	//printf("Данное значение температуры в градусах Цельсия=%f\n", tc);



}